#include <iostream>
#include "Methods.h"

using namespace std;

int main() {
    //Перевод из десятичной в двоичную и обратно
    //decBinary();

    //Перевод из десятичной в восьмиричную и обратно
    //decOctal();

    //Перевод из десятичной в шестнадцатиричную и обратно
    //decHex();

    //Сдвинуть элементы n-го массива на k-позиций вправо
    //move();

    //Возведение матрицы в степень k
    //matrixPower();

    //Умножение матрицы на другую матрицу
    //calcMatrix();

    //Определить является ли строка: идентификатором, записью целого числа, или ничего из выше приведенного
    //defineString();
}